app/Controllers/UserController.php

	public function inscriptionStep2()
	{
		$objectifs = (new ObjectifModel())->findAll();
---
SELECT *
FROM `objectifs`